nce3-2/L37.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-10-21 Sat 10:35 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="author" content="DESKTOP-13B7HQM" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<div id="outline-container-org704b686" class="outline-2">
<h2 id="org704b686">L37 The Westhaven Express</h2>
<div class="outline-text-2" id="text-org704b686">
<p class="verse">
What was the mistake the author made?<br />
<br />
We have learnt to expect that trains will be punctual.<br />
After years of conditioning,<br />
&#xa0;most of us have developed an unshakable faith in raily timetables.<br />
Ships may be delayed by storms; flights may be cancelled because of bad weather;<br />
&#xa0;but trains must be on time.<br />
Only an exceptionally heavy snowfall might temporarily dislocate railway services.<br />
It is all too easy to blame the railway authorities when something does go wrong.<br />
The truth is that when mistakes occur, they are more likely to be ours than theirs.<br />
<br />
After consulting my railway timetable, I noted with satisfaction<br />
&#xa0;that there was an express train to Westhaven.<br />
It went direct from my local station and the journey lasted a mere hour and seventeen minutes.<br />
When I boarded the train, I could not help noticing that a great many local people got on as well.<br />
At the time, this did not strike me as odd.<br />
I reflected that there must be a great many people besides myself<br />
&#xa0;who wished to take advantage of this excellent service.<br />
Neither was I surprised when the train stopped at Widley,<br />
&#xa0;a tiny station a few miles along the line.<br />
Even a mighty express train can be held up by signals.<br />
But when the train dawdled at station after station, I began to wonder.<br />
It suddenly dawned on me that this express was not roaring down the line at ninety miles an hour,<br />
&#xa0;but barely chugging along at thirty.<br />
One hour and seventeen minutes passed and we had not even covered half the distance.<br />
I asked a passenger if this was the Westhaven Express,<br />
&#xa0;but he had not even heard of it.<br />
I determined to lodge a complaint as soon as we arrived.<br />
Two hours later, I was talking angrily to the station master at Westhaven.<br />
When he denied the train's existence, I borrowed his copy of the timetable.<br />
There was a note of triumph in my voice when I told him that it was there in black and white.<br />
Glancing at it briefly, he told me to look again.<br />
A tiny asterisk conducted me to a footnote at the bottom of the page.<br />
It said: 'This service has been suspended.'<br />
</p>
</div>

<div id="outline-container-org8961f6c" class="outline-3">
<h3 id="org8961f6c">words</h3>
<div class="outline-text-3" id="text-org8961f6c">
<p>
express [ɪkˈspres] n.快车<br />
punctual [ˈpʌŋktʃuəl] adj.准时的<br />
condition [kənˈdɪʃ(ə)n] v.使习惯于<br />
unshakable [ʌnˈʃeɪkəbl] adj.不可动摇的<br />
faith [feɪθ] n.信任<br />
cancel [ˈkæns(ə)l] v.取消<br />
exceptionally [ɪkˈsepʃənəli] adv.例外地<br />
dislocate [ˈdɪsloʊkeɪt] v.打乱(计划等)<br />
blame [bleɪm] v.责怪<br />
consult [kənˈsʌlt] v.请教<br />
direct [dəˈrekt] adv.径直地<br />
odd [ɑːd] adj.奇怪的<br />
reflect [rɪˈflekt] v.细想<br />
advantage [ədˈvæntɪdʒ] n.优势<br />
mighty [ˈmaɪti] adj.强大的<br />
dawdle [ˈdɔːd(ə)l] v.慢吞吞地动<br />
chug [tʃʌɡ] v.咔嚓喀嚓地响<br />
lodge [lɑːdʒ] v.提出<br />
complaint [kəmˈpleɪnt] n.抱怨<br />
triumph [ˈtraɪʌmf] n.胜利<br />
asterisk [ˈæstərɪsk] n.星号<br />
conduct [kənˈdʌkt] v.引向<br />
</p>
</div>
</div>
</div>
</div>
</body>
</html>
